reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
    // -------- Bus I2C nº0: TCS34725 DELANTERO + VL53L1X ---------------------
    constexpr uint8_t I2C0_SDA = 8;
    constexpr uint8_t I2C0_SCL = 9;

    // -------- Bus I2C nº1: TCS34725 TRASERO + PCA9685 (servos) --------------
    // Los dos TCS34725 comparten la misma dirección fija (0x29): van en buses
    // separados para no necesitar un multiplexor TCA9548A.
    //
    // El PCA9685 se movió a este bus por decisión del equipo, para no sumar
    // un tercer dispositivo al bus 0 (que ya tiene el TCS34725 delantero y
    // el VL53L1X, con su propia coreografía de XSHUT). Su dirección (0x40)
    // no choca con la del TCS34725 trasero (0x29); el riesgo que sí aparece
    // es de concurrencia entre tareas — ver g_i2c1Mutex.
    constexpr uint8_t I2C1_SDA = 47;
    constexpr uint8_t I2C1_SCL = 48;

    // -------- LED de iluminación del TCS34725 DELANTERO ---------------------
    // El trasero se cableó directo a 3.3V (ver hardware/conexiones-esp32-
    // s3.md) -- GPIO21 quedó libre para el switch de equipo, más abajo.
    constexpr uint8_t TCS_LED_FRONT = 18;

    // -------- VL53L1X (ToF), delante del gripper ---------------------------
    // Comparte el bus I2C nº0 con el TCS34725 delantero (mismo 0x29 de
    // fábrica): XSHUT lo mantiene en reset hasta reasignarle dirección.
    constexpr uint8_t TOF_XSHUT = 3;

    // -------- Reflectancia QTRX-HD-01A (salida analógica) ------------------
    // ¡ALIMENTARLOS A 3.3 V! Ver la nota larga en ReflectanceTask.
    constexpr uint8_t QTR_LEFT_OUT  = 1;  // GPIO1 = ADC1_CH0
    constexpr uint8_t QTR_RIGHT_OUT = 2;  // GPIO2 = ADC1_CH1
    constexpr uint8_t QTR_EMITTER_CTRL = 42;

    // -------- LED RGB indicador de equipo / zona / bandera ------------------
    constexpr uint8_t LED_RGB_R = 39;
    constexpr uint8_t LED_RGB_G = 38;
    constexpr uint8_t LED_RGB_B = 41;

    // -------- Switch de 3 posiciones (ON-OFF-ON): selección de equipo ------
    // Reemplaza al viejo puente TEAM_SELECT de un solo pin (GND=ROJO,
    // abierto=AZUL, sin reposo real): ahora hay una posición central de
    // verdad (0 = nadie ha elegido todavía), igual que en firmware-esp32/.
    // El común del switch va a GND; cada tiro cierra a GND uno de estos 2
    // GPIO, leídos con pull-up interno (INPUT_PULLUP): HIGH = tiro abierto,
    // LOW = tiro cerrado. GPIO21 se liberó del LED trasero del TCS34725 (ver
    // arriba); GPIO40 es el mismo pin que ya usaba TEAM_SELECT.
    // Mismo cableado físico que firmware-esp32/ -- ver el comentario ahí:
    // el tiro "AZUL" quedó en GPIO 40 y el "ROJO" en GPIO 21, al revés del
    // borrador original de hardware/conexiones-esp32-s3.md.
    constexpr uint8_t TEAM_SWITCH_BLUE = 40;  // tiro "AZUL" cerrado a GND = equipo azul
    constexpr uint8_t TEAM_SWITCH_RED  = 21;  // tiro "ROJO" cerrado a GND = equipo rojo
}

namespace I2CAddr {
    constexpr uint8_t PCA9685  = 0x40;
    constexpr uint8_t TCS34725 = 0x29;
    // Ver la nota larga en firmware-esp32/src/main.cpp junto a esta misma
    // constante: es una única escritura corta mientras el VL53L1X todavía
    // responde en 0x29, el mismo instante en que el TCS34725 delantero
    // también sigue vivo ahí. Riesgo acotado y aceptado a propósito.
    constexpr uint8_t VL53L1X_BOOT_ADDR = 0x29;
    constexpr uint8_t VL53L1X = 0x30;
}

namespace ServoChannel {
    constexpr uint8_t CLAW = 0;   // abre/cierra la pinza
}

namespace Pwm {
    constexpr uint32_t MOTOR_FREQ_HZ    = 1000;
    constexpr uint8_t  MOTOR_RESOLUTION = 8;     // duty 0..255

    constexpr uint32_t RGB_FREQ_HZ    = 5000;
    constexpr uint8_t  RGB_RESOLUTION = 8;       // duty 0..255

    constexpr uint32_t SERVO_FREQ_HZ  = 50;
    constexpr uint16_t SERVO_TICK_MIN = 205;   // pulso 1.0 ms ->   0 grados
    constexpr uint16_t SERVO_TICK_MAX = 410;   // pulso 2.0 ms -> 180 grados
}

// Prioridades FreeRTOS (mayor número = mayor prioridad).
namespace TaskPriority {
    constexpr UBaseType_t SUPERVISOR      = 6;
    constexpr UBaseType_t MOTOR_CONTROL   = 5;
    constexpr UBaseType_t MISSION         = 4;  // el cerebro: no debe acumular retraso
    constexpr UBaseType_t GRIPPER_CONTROL = 3;
    constexpr UBaseType_t REFLECTANCE     = 3;
    constexpr UBaseType_t COLOR_SENSOR    = 2;
    constexpr UBaseType_t TOF_SENSOR      = 2;
    constexpr UBaseType_t LED_STATUS      = 1;
}

namespace TaskStack {
    constexpr uint32_t SUPERVISOR      = 3072;
    constexpr uint32_t MISSION         = 4096;  // máquina de estados + logs
    constexpr uint32_t MOTOR_CONTROL   = 3072;
    constexpr uint32_t GRIPPER_CONTROL = 3072;
    constexpr uint32_t REFLECTANCE     = 2560;
    constexpr uint32_t COLOR_SENSOR    = 3584;
    constexpr uint32_t TOF_SENSOR      = 4096;
    constexpr uint32_t LED_STATUS      = 2048;
}

namespace TaskPeriodMs {
    constexpr uint32_t SUPERVISOR    = 200;
    constexpr uint32_t MISSION       = 50;   // 20 Hz, de sobra para decidir
    constexpr uint32_t MOTOR_CONTROL = 20;   // 50 Hz
    constexpr uint32_t GRIPPER       = 50;
    constexpr uint32_t REFLECTANCE   = 20;   // 50 Hz, seguimiento de línea
    constexpr uint32_t COLOR_SENSOR  = 100;  // 10 Hz
    constexpr uint32_t TOF_SENSOR    = 50;   // 20 Hz, igual al periodo de rango
    constexpr uint32_t LED_STATUS    = 100;  // más rápido que antes: hace falta para el destello de 5 Hz
}

// Sin heartbeat por más de este tiempo, el supervisor da la tarea por colgada.
constexpr uint32_t WATCHDOG_TIMEOUT_MS = 1000;

// Si MotorTask pasa este tiempo sin un comando fresco de MissionTask, frena
// por su cuenta. Ya no protege contra "se cayó el enlace con la Raspberry
// Pi" (no existe): protege contra "MissionTask se colgó" — mismo mecanismo,
// mismo valor, otro origen del riesgo.
constexpr uint32_t MISSION_FAILSAFE_TIMEOUT_MS = 500;

enum class TaskId : uint8_t {
    MOTOR_CONTROL = 0,
    GRIPPER_CONTROL,
    COLOR_SENSOR,
    REFLECTANCE,
    LED_STATUS,
    TOF_SENSOR,
    MISSION,
    COUNT   // siempre el último
};

#define DEBUG_LINK Serial   // USB nativo: sin Raspberry Pi, no hace falta reservarlo aparte

