reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// ===========================================================================
//  [2] TIPOS COMPARTIDOS ENTRE TAREAS
// ===========================================================================

enum class TeamColor     : uint8_t { NONE = 0, RED = 1, BLUE = 2 };
enum class MotorMode     : uint8_t { STOP = 0, DRIVE = 1 };
enum class GripperAction : uint8_t { OPEN = 0, CLOSE_LLAVE = 1, CLOSE_BANDERA = 2 };
enum class ColorLabel    : uint8_t { UNKNOWN = 0, BLACK, YELLOW, RED, BLUE, FLOOR };

struct MotorCommand {
    MotorMode mode = MotorMode::STOP;
    int8_t    left  = 0;   // -100..100 (%), lado izquierdo (FL+RL)
    int8_t    right = 0;   // -100..100 (%), lado derecho  (FR+RR)
};

struct GripperCommand {
    GripperAction action = GripperAction::OPEN;
};

// El LED aquí tiene un solo trabajo: decir sobre qué línea/zona está el
// robot AHORA MISMO. MissionTask ya tiene la lectura de color a mano (la
// necesita para decidir), así que se la pasa a LedTask en vez de que
// LedTask vuelva a suscribirse a colorQueue por su cuenta — una sola tarea
// consume cada cola.
struct LedCommand {
    ColorLabel zone = ColorLabel::UNKNOWN;
};

struct ColorReading {
    uint32_t   timestamp_ms = 0;
    ColorLabel front        = ColorLabel::UNKNOWN;
    ColorLabel back         = ColorLabel::UNKNOWN;
    bool       front_valid  = false;
    bool       back_valid   = false;
};

struct ReflectanceReading {
    uint32_t timestamp_ms  = 0;
    uint16_t left_raw      = 0;
    uint16_t right_raw     = 0;
    bool     left_on_line  = false;
    bool     right_on_line = false;
};

struct TofReading {
    uint32_t timestamp_ms = 0;
    uint16_t distance_mm  = 0;
    bool     valid        = false;
};

struct HealthReport {
    uint32_t timestamp_ms          = 0;
    uint8_t  faulted_tasks_bitmask = 0;
};

// ===========================================================================
//  [3] COLAS
// ===========================================================================
//
//   MissionTask --> motorCmdQueue   (1, overwrite) --> MotorTask
//               --> gripperCmdQueue (4, FIFO)      --> GripperTask
//               --> ledCmdQueue     (1, overwrite) --> LedTask
//
//   ColorSensorTask --> colorQueue   (4, FIFO)      --> MissionTask
//   ReflectanceTask --> reflectQueue (4, FIFO)      --> MissionTask
//   TofSensorTask   --> tofQueue     (4, FIFO)      --> MissionTask
//   SupervisorTask  --> healthQueue  (1, overwrite) --> MissionTask (solo log)
//
//  Mismo criterio que en firmware-esp32/: colas "overwrite" para datos donde
//  solo importa el valor más reciente, FIFO para eventos que hay que ver
//  todos y en orden. Ninguna tarea usa portMAX_DELAY: todo timeout 0.

static QueueHandle_t g_motorCmdQueue   = nullptr;
static QueueHandle_t g_gripperCmdQueue = nullptr;
static QueueHandle_t g_ledCmdQueue     = nullptr;
static QueueHandle_t g_colorQueue      = nullptr;
static QueueHandle_t g_reflectQueue    = nullptr;
static QueueHandle_t g_tofQueue        = nullptr;
static QueueHandle_t g_healthQueue     = nullptr;

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº0 (Wire) — TCS34725 delantero + VL53L1X.
// ---------------------------------------------------------------------------
//  LAS DOS TAREAS QUE TOCAN ESTE BUS CORREN EN EL MISMO NÚCLEO (0: sensores),
//  pero eso no alcanza para que `Wire`/`TwoWire` sea segura entre ellas:
//  ninguna deshabilita el planificador durante una transacción I2C, así que
//  un cambio de contexto a mitad de un beginTransmission()/endTransmission()
//  puede intercalar los bytes de ColorSensorTask con los de TofSensorTask
//  sobre el mismo objeto `Wire`. Eso corrompe el bus de forma intermitente
//  — exactamente los "problemas de I2C" que se ven en banco entre el ToF y
//  el sensor de color — sin que ninguno de los dos esté roto por separado.
//
//  Este mutex serializa toda transacción sobre el bus 0: cada tarea lo toma
//  antes de tocar `Wire` y lo suelta apenas termina.
//
//  Con timeout corto (no portMAX_DELAY, por la misma regla que las colas):
//  si no se consigue el bus en I2C0_LOCK_TIMEOUT_MS, la operación se da por
//  fallida esta vuelta y se reintenta en la siguiente — mismo espíritu que
//  ya tienen los drivers de este archivo (nunca bloquear indefinidamente a
//  cambio de un periférico que tarda).
//
//  El PCA9685, que antes vivía acá también, se movió al bus 1 (ver
//  g_i2c1Mutex, justo abajo) por decisión del equipo: ya no forma parte de
//  este mutex.
static SemaphoreHandle_t g_i2c0Mutex = nullptr;
constexpr uint32_t I2C0_LOCK_TIMEOUT_MS = 50;

static inline bool I2c0Lock() {
    return xSemaphoreTake(g_i2c0Mutex, pdMS_TO_TICKS(I2C0_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c0Unlock() {
    xSemaphoreGive(g_i2c0Mutex);
}

// ---------------------------------------------------------------------------
//  Mutex del bus I2C nº1 (Wire1) — TCS34725 trasero + PCA9685 (servos).
// ---------------------------------------------------------------------------
//  Mismo problema que el bus 0, con el mismo mecanismo, esta vez entre
//  núcleos distintos: GripperTask (el PCA9685) corre en el núcleo 1,
//  ColorSensorTask (el TCS34725 trasero) en el núcleo 0 — pueden estar
//  ejecutando una transacción I2C cada una AL MISMO TIEMPO. El bus 1 era
//  seguro sin mutex mientras solo tuviera un dispositivo; deja de serlo en
//  cuanto el PCA9685 se muda acá.
static SemaphoreHandle_t g_i2c1Mutex = nullptr;
constexpr uint32_t I2C1_LOCK_TIMEOUT_MS = 50;

static inline bool I2c1Lock() {
    return xSemaphoreTake(g_i2c1Mutex, pdMS_TO_TICKS(I2C1_LOCK_TIMEOUT_MS)) == pdTRUE;
}

static inline void I2c1Unlock() {
    xSemaphoreGive(g_i2c1Mutex);
}

// ===========================================================================
//  [4] WATCHDOG COOPERATIVO
// ===========================================================================

static volatile uint32_t g_lastHeartbeatMs[(size_t)TaskId::COUNT];

static void WatchdogInit() {
    const uint32_t now = millis();
    for (size_t i = 0; i < (size_t)TaskId::COUNT; ++i) g_lastHeartbeatMs[i] = now;
}

