reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
bool TofBringUp() {
    g_tof.setBus(&Wire);
    g_tof.setTimeout(500);
    g_tof.setAddress(I2CAddr::VL53L1X);

    if (!g_tof.init()) return false;

    g_tof.setDistanceMode(VL53L1X::Long);
    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
    return true;
}

void TofSensorTask(void *) {
    digitalWrite(Pins::TOF_XSHUT, HIGH);
    delay(Tof::BOOT_DELAY_MS);

    // TofBringUp() incluye la reasignación de dirección del VL53L1X (ver la
    // nota larga en I2CAddr::VL53L1X_BOOT_ADDR): esa escritura ocurre
    // mientras el chip todavía responde en 0x29, la MISMA dirección del
    // TCS34725 delantero. El mutex del bus (g_i2c0Mutex) resuelve un riesgo
    // DISTINTO: que dos tareas corrompan el objeto `Wire` al llamarlo a la
    // vez. NO elimina el choque de direcciones en sí — durante esa escritura
    // puntual, los dos chips siguen respondiendo a 0x29 a nivel eléctrico,
    // sea cual sea la tarea que la origine. Sigue siendo "un riesgo acotado
    // y aceptado" (una sola transacción de 3 bytes, no la inicialización
    // completa), igual que documenta I2CAddr::VL53L1X_BOOT_ADDR — el mutex
    // ayuda a que esta ventana sea lo más corta y predecible posible, no a
    // que deje de existir.
    bool tof_ok = false;
    if (I2c0Lock()) {
        tof_ok = TofBringUp();
        I2c0Unlock();
    }
    if (!tof_ok) {
        DEBUG_LINK.println("[ToF] VL53L1X no responde. Reintentando en segundo plano.");
    }

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::TOF_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if (!tof_ok && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (I2c0Lock()) {
                tof_ok = g_tof.init();
                if (tof_ok) {
                    g_tof.setDistanceMode(VL53L1X::Long);
                    g_tof.setMeasurementTimingBudget(Tof::TIMING_BUDGET_US);
                    g_tof.startContinuous(Tof::RANGING_PERIOD_MS);
                }
                I2c0Unlock();
            }
        }

        TofReading reading;
        reading.timestamp_ms = millis();

        if (tof_ok && I2c0Lock()) {
            if (g_tof.dataReady()) {
                reading.distance_mm = g_tof.read(false);
                reading.valid = !g_tof.timeoutOccurred() &&
                                g_tof.ranging_data.range_status == VL53L1X::RangeValid;
                if (g_tof.timeoutOccurred()) tof_ok = false;
            }
            I2c0Unlock();
        }

        PushDropOldest(g_tofQueue, reading);

        Heartbeat(TaskId::TOF_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.4  ColorSensorTask — TCS34725 delantero (Wire) y trasero (Wire1)
// ---------------------------------------------------------------------------

void ColorSensorTask(void *) {
    pinMode(Pins::TCS_LED_FRONT, OUTPUT);
    digitalWrite(Pins::TCS_LED_FRONT, HIGH);

    // El sensor DELANTERO vive en Wire (bus I2C nº0), junto con el VL53L1X:
    // sus llamadas van protegidas por g_i2c0Mutex. El TRASERO vive en Wire1
    // (bus nº1), que ahora comparte con el PCA9685 desde que el gripper se
    // movió ahí: sus llamadas van protegidas por g_i2c1Mutex, por la misma
    // razón (ver la nota larga junto a las declaraciones de ambos mutex).
    bool front_ok = false;
    if (I2c0Lock()) {
        front_ok = Tcs34725::Init(Wire);
        I2c0Unlock();
    }
    bool back_ok = false;
    if (I2c1Lock()) {
        back_ok = Tcs34725::Init(Wire1);
        I2c1Unlock();
    }

    if (!front_ok) DEBUG_LINK.println("[Color] sensor DELANTERO no responde (bus I2C 0).");
    if (!back_ok)  DEBUG_LINK.println("[Color] sensor TRASERO no responde (bus I2C 1).");

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::COLOR_SENSOR);
    TickType_t last_wake = xTaskGetTickCount();
    uint32_t last_retry_ms = millis();

    for (;;) {
        if ((!front_ok || !back_ok) && (uint32_t)(millis() - last_retry_ms) > 1000) {
            last_retry_ms = millis();
            if (!front_ok && I2c0Lock()) {
                front_ok = Tcs34725::Init(Wire);
                I2c0Unlock();
            }
            if (!back_ok && I2c1Lock()) {
                back_ok = Tcs34725::Init(Wire1);
                I2c1Unlock();
            }
        }

        ColorReading reading;
        reading.timestamp_ms = millis();

        Tcs34725::Rgbc sample;
        if (front_ok) {
            bool read_ok = false;
            if (I2c0Lock()) {
                read_ok = Tcs34725::Read(Wire, sample);
                I2c0Unlock();
            }
            if (read_ok) {
                reading.front = ClassifyColor(sample);
                reading.front_valid = true;

                // DIAGNÓSTICO TEMPORAL para recalibrar ClassifyColor() en
                // banco: sostén el sensor DELANTERO sobre cada superficie de
                // la pista (negro, amarillo, rojo, azul, piso gris) y lee
                // los valores normalizados de acá. Los umbrales actuales
                // (r/g/b sobre `clear`) están calibrados con datos viejos —
                // ver calibracion/color/ para el proceso formal con más
                // muestras. Quitar este log una vez recalibrado.
                static uint32_t last_color_log_ms = 0;
                if ((uint32_t)(millis() - last_color_log_ms) > 500) {
                    last_color_log_ms = millis();
                    const float total = (float)sample.c;
                    DEBUG_LINK.printf(
                        "[Color] clear=%u r=%u g=%u b=%u | r/c=%.3f g/c=%.3f b/c=%.3f -> %s\n",
                        sample.c, sample.r, sample.g, sample.b,
                        (float)sample.r / total, (float)sample.g / total, (float)sample.b / total,
                        ColorLabelName(reading.front));
                }
            } else {
                front_ok = false;
            }
        }

        if (back_ok) {
            bool read_ok = false;
            if (I2c1Lock()) {
                read_ok = Tcs34725::Read(Wire1, sample);
                I2c1Unlock();
            }
            if (read_ok) {
                reading.back = ClassifyColor(sample);
                reading.back_valid = true;
            } else {
                back_ok = false;
            }
        }

        PushDropOldest(g_colorQueue, reading);

        Heartbeat(TaskId::COLOR_SENSOR);
        vTaskDelayUntil(&last_wake, period);
    }
}

// ---------------------------------------------------------------------------
//  8.5  ReflectanceTask — 2x QTRX-HD-01A
// ---------------------------------------------------------------------------
//  Valor ADC ALTO = superficie OSCURA (cinta negra del borde). Ver la nota
//  larga en firmware-esp32/src/main.cpp si esto no es intuitivo.

constexpr uint16_t kDarkThreshold = 2048;   // TODO: calibrar en la pista real

void ReflectanceTask(void *) {
    analogReadResolution(12);
    analogSetPinAttenuation(Pins::QTR_LEFT_OUT, ADC_11db);
    analogSetPinAttenuation(Pins::QTR_RIGHT_OUT, ADC_11db);

    pinMode(Pins::QTR_EMITTER_CTRL, OUTPUT);
    digitalWrite(Pins::QTR_EMITTER_CTRL, HIGH);

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::REFLECTANCE);
    TickType_t last_wake = xTaskGetTickCount();

