reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
// Nombre legible de cada fase, para el log — sin esto, el monitor serial
// solo mostraba el número crudo del enum y había que contar a mano.
inline const char *PhaseName(Phase phase) {
    switch (phase) {
        case Phase::ARRANQUE:            return "ARRANQUE";
        case Phase::ASEGURAR_LLAVE:      return "ASEGURAR_LLAVE";
        case Phase::RETROCEDER_A_ZONA_NEUTRA: return "RETROCEDER_A_ZONA_NEUTRA";
        case Phase::BUSCAR_ZONA_NEUTRA:  return "BUSCAR_ZONA_NEUTRA";
        case Phase::DEPOSITAR_LLAVE:     return "DEPOSITAR_LLAVE";
        case Phase::BUSCAR_BANDERA:      return "BUSCAR_BANDERA";
        case Phase::AGARRAR_BANDERA:     return "AGARRAR_BANDERA";
        case Phase::RETORNAR_GIRANDO:    return "RETORNAR_GIRANDO";
        case Phase::RETORNAR_AVANZANDO:  return "RETORNAR_AVANZANDO";
        case Phase::ENTREGAR:            return "ENTREGAR";
        case Phase::TERMINADO:           return "TERMINADO";
        default:                         return "DESCONOCIDA";
    }
}

} // namespace Mission

// Evita depender de que el compilador trate a MotorCommand como agregado
// con inicializadores por defecto (necesita C++14+); igual que hace
// firmware-esp32/src/main.cpp, se asigna campo a campo.
inline void SetDrive(MotorCommand &m, int left, int right) {
    m.mode  = MotorMode::DRIVE;
    m.left  = (int8_t)constrain(left, -100, 100);
    m.right = (int8_t)constrain(right, -100, 100);
}

void MissionTask(void *pvTeam) {
    const TeamColor team = *reinterpret_cast<TeamColor *>(pvTeam);

    Mission::Phase phase = Mission::Phase::ARRANQUE;
    Mission::Phase last_logged_phase = phase;
    uint32_t phase_started_ms = millis();

    // Estado propio del barrido de búsqueda (fase BUSCAR_BANDERA).
    bool     buscando_gira = true;
    int8_t   sentido = 1;
    uint8_t  tof_hits = 0;

    ColorReading       last_color{};
    ReflectanceReading last_reflect{};
    TofReading         last_tof{};

    const TickType_t period = pdMS_TO_TICKS(TaskPeriodMs::MISSION);
    TickType_t last_wake = xTaskGetTickCount();

    DEBUG_LINK.printf("[Mission] equipo = %s\n", team == TeamColor::RED ? "ROJO" : "AZUL");

    for (;;) {
        // --- 0. Refrescar la última lectura de cada sensor -----------------
        // Igual que hacía run_rover.py: se drena toda la cola y solo importa
        // el dato más reciente de cada tipo.
        ColorReading c;
        while (xQueueReceive(g_colorQueue, &c, 0) == pdTRUE) last_color = c;
        ReflectanceReading r;
        while (xQueueReceive(g_reflectQueue, &r, 0) == pdTRUE) last_reflect = r;
        TofReading t;
        while (xQueueReceive(g_tofQueue, &t, 0) == pdTRUE) last_tof = t;
        HealthReport h;
        while (xQueueReceive(g_healthQueue, &h, 0) == pdTRUE) {
            DEBUG_LINK.printf("[Mission] tareas colgadas, bitmask=0x%02X\n", h.faulted_tasks_bitmask);
        }

        MotorCommand motor;               // por defecto: STOP
        GripperCommand gripper;
        bool send_gripper = false;

        // Interruptor de batería baja (Mission::kMotionEnabled): si está en
        // false, todo lo de aquí abajo se salta por completo. motor se queda
        // en su valor por defecto (STOP) y gripper nunca se envía — el
        // robot no mueve nada, solo sigue leyendo sensores y mostrando la
        // zona por el LED (eso pasa siempre, fuera de este bloque).
        if (Mission::kMotionEnabled) {

        // --- 1. PRIORIDAD MÁXIMA: no salirse de la pista -------------------
        // Idéntico a decision.py::_evadir_borde: pisa cualquier otra fase...
        // EXCEPTO mientras se asegura la llave. Pedido explícito: el gripper
        // tiene que cerrar ANTES de que el robot se mueva por cualquier
        // motivo, incluida la evasión de borde. Sin este freno, un umbral de
        // reflectancia sin calibrar (ver kDarkThreshold) podía hacer que el
        // robot arrancara moviéndose para atrás desde el segundo 0, sin que
        // el switch(phase) de más abajo llegara siquiera a mandar
        // CLOSE_LLAVE (evadiendo=true se salta ese switch por completo).
        const bool puede_moverse = (phase != Mission::Phase::ARRANQUE &&
                                     phase != Mission::Phase::ASEGURAR_LLAVE);
        bool evadiendo = false;
        if (puede_moverse) {
            if (last_reflect.left_on_line && last_reflect.right_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
                evadiendo = true;
            } else if (last_reflect.left_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion / 3);
                evadiendo = true;
            } else if (last_reflect.right_on_line) {
                SetDrive(motor, -Mission::kVelocidadAproximacion / 3, -Mission::kVelocidadAproximacion);
                evadiendo = true;
            }
        }

        // DIAGNÓSTICO TEMPORAL: kDarkThreshold nunca se calibró contra el
        // piso/luz reales (ver el TODO junto a su declaración). Si el robot
        // solo retrocede y el gripper nunca recibe comandos, lo primero a
        // revisar es si "evadiendo" da true todo el tiempo — este log
        // muestra los valores crudos para comparar contra el umbral.
        // Quitar una vez que kDarkThreshold quede calibrado en banco.
        {
            static uint32_t last_reflect_log_ms = 0;
            if ((uint32_t)(millis() - last_reflect_log_ms) > 500) {
                last_reflect_log_ms = millis();
                DEBUG_LINK.printf(
                    "[Reflect] izq=%u der=%u (umbral=%u) on_line: izq=%d der=%d "
                    "-> puede_moverse=%d evadiendo=%d\n",
                    last_reflect.left_raw, last_reflect.right_raw, kDarkThreshold,
                    last_reflect.left_on_line, last_reflect.right_on_line,
                    puede_moverse, evadiendo);
            }
        }

        // Ayuda a depurar en banco: cambiar de fase se ve en el monitor
        // serial sin tener que instrumentar cada rama.
        if (phase != last_logged_phase) {
            DEBUG_LINK.printf("[Mission] fase -> %s\n", Mission::PhaseName(phase));
            last_logged_phase = phase;
        }

        if (!evadiendo) {
            switch (phase) {

                // -- 2. Cuenta regresiva para cargar la llave a mano --------
                case Mission::Phase::ARRANQUE: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kStartupDelayMs) {
                        phase = Mission::Phase::ASEGURAR_LLAVE;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 3. Asegurar la llave que el operador ya colocó ---------
                case Mission::Phase::ASEGURAR_LLAVE: {
                    gripper.action = GripperAction::CLOSE_LLAVE;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    }
                    break;
                }

