reymenez323/Athena-Rover-2026/firmware-esp32-standalone/src/main.cpp
                // -- 4. Avanzar hasta pisar la zona amarilla ----------------
                // Usa el sensor TRASERO: el delantero no está midiendo bien
                // (ver el diagnóstico en ColorSensorTask) -- cambio temporal
                // hasta que se resuelva el cableado del delantero.
                case Mission::Phase::BUSCAR_ZONA_NEUTRA: {
                    if (last_color.back_valid && last_color.back == ColorLabel::YELLOW) {
                        phase = Mission::Phase::RETROCEDER_A_ZONA_NEUTRA;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, Mission::kVelocidadCrucero, Mission::kVelocidadCrucero);
                    }
                    break;
                }

                // -- 4b. Retroceder para que el FRENTE (no solo el sensor
                // trasero) quede dentro de la zona amarilla --------------
                // El trasero recién detecta el amarillo cuando ya lo pasó
                // de largo -- sin este paso, la llave (al frente) quedaría
                // más allá de la zona segura, no dentro. Tiempo fijo, sin
                // sensor: Mission::kRetrocesoZonaNeutraMs es el único número
                // que hay que ajustar en banco según cuánto se pasa.
                case Mission::Phase::RETROCEDER_A_ZONA_NEUTRA: {
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kRetrocesoZonaNeutraMs) {
                        phase = Mission::Phase::DEPOSITAR_LLAVE;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, -Mission::kVelocidadAproximacion, -Mission::kVelocidadAproximacion);
                    }
                    break;
                }

                // -- 5. Soltar la llave: única transición que habilita ------
                //       la búsqueda de bandera (igual que decision.py).
                case Mission::Phase::DEPOSITAR_LLAVE: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::BUSCAR_BANDERA;
                        phase_started_ms = millis();
                        buscando_gira = true;
                        tof_hits = 0;
                    }
                    break;
                }

                // -- 6. Barrer el área; el VL53L1X hace de "ojos" ----------
                // LIMITACIÓN A PROPÓSITO (ver el aviso grande arriba): no
                // hay forma de confirmar que lo que se detecta es la
                // bandera del equipo contrario y no cualquier otro objeto
                // u obstáculo. Es la mejor aproximación posible sin cámara.
                case Mission::Phase::BUSCAR_BANDERA: {
                    if (last_tof.valid && last_tof.distance_mm <= Mission::kDistanciaAgarreMm) {
                        if (tof_hits < 255) tof_hits++;
                    } else {
                        tof_hits = 0;
                    }

                    if (tof_hits >= Mission::kTofDebounceHits) {
                        phase = Mission::Phase::AGARRAR_BANDERA;
                        phase_started_ms = millis();
                        break;
                    }

                    const uint32_t elapsed = millis() - phase_started_ms;
                    if (buscando_gira) {
                        SetDrive(motor, Mission::kVelocidadBusqueda * sentido,
                                        -Mission::kVelocidadBusqueda * sentido);
                        if (elapsed > Mission::kSpinBurstMs) {
                            buscando_gira = false;
                            phase_started_ms = millis();
                        }
                    } else {
                        // Avance con un leve arco, para barrer el ToF a
                        // ambos lados en vez de solo mirar de frente.
                        const int base = Mission::kVelocidadAproximacion;
                        const int sesgo = 10 * sentido;
                        SetDrive(motor, base + sesgo, base - sesgo);
                        if (elapsed > Mission::kForwardBurstMs) {
                            buscando_gira = true;
                            sentido = (int8_t)-sentido;   // alterna el lado del barrido
                            phase_started_ms = millis();
                        }
                    }
                    break;
                }

                // -- 7. Cerrar la pinza sobre lo que haya delante -----------
                case Mission::Phase::AGARRAR_BANDERA: {
                    gripper.action = GripperAction::CLOSE_BANDERA;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::RETORNAR_GIRANDO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 8a. Girar ~180° antes de buscar la zona propia ---------
                // Sin odometría ni referencia visual (mismo hueco que anota
                // decision.py::_retornar): es un giro a tiempo fijo, A
                // CALIBRAR EN BANCO según el peso real del robot y la
                // fricción de la pista.
                case Mission::Phase::RETORNAR_GIRANDO: {
                    SetDrive(motor, Mission::kVelocidadBusqueda, -Mission::kVelocidadBusqueda);
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kReturnTurnMs) {
                        phase = Mission::Phase::RETORNAR_AVANZANDO;
                        phase_started_ms = millis();
                    }
                    break;
                }

                // -- 8b. Avanzar hasta pisar la zona del propio equipo ------
                // Sensor TRASERO -- ver la nota en BUSCAR_ZONA_NEUTRA.
                case Mission::Phase::RETORNAR_AVANZANDO: {
                    if (last_color.back_valid && last_color.back == Mission::ZonaPropia(team)) {
                        phase = Mission::Phase::ENTREGAR;
                        phase_started_ms = millis();
                    } else {
                        SetDrive(motor, Mission::kVelocidadCrucero, Mission::kVelocidadCrucero);
                    }
                    break;
                }

                // -- 9. Soltar la bandera en zona propia ---------------------
                case Mission::Phase::ENTREGAR: {
                    gripper.action = GripperAction::OPEN;
                    send_gripper = true;
                    if ((uint32_t)(millis() - phase_started_ms) > Mission::kGripperSettleMs) {
                        phase = Mission::Phase::TERMINADO;
                        phase_started_ms = millis();
                    }
                    break;
                }

